{"author": "Cody Doremus", "capabilities": [""], "category_id": "5261a8fb3b773043d500000f", "category_name": "Tools & Utilities", "category_color": "fdbf37", "changelog": [{"version": "3.2", "published_date": "2016-02-05T18:24:05.678Z", "release_notes": "Reduced size of messages between watch and phone which is now allowing the Timestamp to the Timeline to work on the original Pebble! "}, {"version": "3.1", "published_date": "2016-01-30T05:04:27.637Z", "release_notes": "Added a minute count since the last timestamp in the top right corner in a small unobtrusive font. It should get to 9999 before running out of room."}, {"version": "3.0", "published_date": "2016-02-02T15:23:18.741Z", "release_notes": "Added voice dictation to control the label for the list and timeline pins if you have a PebbleTime! There is a 5th menu option to turn this OFF or ON. It will default to ON so current users know it is available. \r\nThere is no prompt before it shows up since the idea of the app is to log the current time as fast as possible."}, {"version": "2.4", "published_date": "2015-10-28T03:09:01.849Z", "release_notes": "Added sending worthless data from the watch to the phone because updated Pebble Time software would not send blank data. This allows the timestamp request to get to the phone and pin to the timeline again."}, {"version": "2.3", "published_date": "2015-06-23T11:52:38.266Z", "release_notes": "Bug fix: Properly checking if images exist so I don't make double and I only delete created images."}, {"version": "2.2", "published_date": "2015-06-13T23:07:42.509Z", "release_notes": "Reduced Stampete from 50 to 49 for the stamp time. Large 24 hour Timestamps were getting cut off."}, {"version": "2.1", "published_date": "2015-06-13T20:27:04.139Z", "release_notes": "Window did not initialize correctly after start new list with current. Going back to main screen to force the Window update. "}, {"version": "2.0", "published_date": "2015-06-13T05:06:46.548Z", "release_notes": "Added support for black and white pebble! Now they can have all the Timestamp goodness using the list. Full support is included for when the firmware/os is updated to support the timeline.\r\n\r\nList now supports 50 items! I don't plan on making it more than that because do you really want to scroll through that many entries? Fixed the logic error where once the list was full the timestamp you just took would not show up until the next time you took a timestamp.\r\n\r\nSpruced up the list of icons on Pebble Time to have an orange background and the status bar from black and white pebble."}, {"version": "1.9", "published_date": "2015-06-12T05:23:40.865Z", "release_notes": "Realized I was inconsistent with my wording on the menu options. Changed \"Stamp\" to \"Timestamp\" to be less confusing. I originally thought I did not have enough characters."}, {"version": "1.8", "published_date": "2015-06-12T05:07:57.052Z", "release_notes": "Added options to manage your list of Timestamps!\r\nYou can now delete a single entry, start a new list with the stamp you created going into the app (The \"Uh oh, I wanted this to be the first entry\" option. I suspect this will be the most used), create a new stamp without exiting the app, or Delete Your Entire List and start over!\r\n\r\nRecorded calling the Timestamp prior to updating the time so the seconds in the stamp would be more accurate."}, {"version": "1.7", "published_date": "2015-06-11T05:25:32.145Z", "release_notes": "Added seconds to the list view in the app. Seconds will not show up on the pin for the timeline.\r\nIncreased list to 35 values. Fixed logic error causing current entry to not show on the list.\r\n\r\nOption to clear list still planned..."}, {"version": "1.6", "published_date": "2015-06-10T14:18:32.631Z", "release_notes": "Added a menu list to see your last 31 timestamps. This will be updated when you load the app independent of if the Timestamp pin was successfully sent to your Timeline. Once you hit 31 stamps the oldest will be replaced. In the next version I plan to add a way to reset this list. \r\n\r\nBug fix to update battery level on load. \r\n\r\nAttempt at fixing multiple timestamps from the java on the phone resetting. If it resets just right you can still get double Timeline stamps, but not on the app list! "}, {"version": "1.5", "published_date": "2015-06-08T03:38:11.303Z", "release_notes": "Added better error handling. You will have to wait longer to see the \"STAMPED TO TIMELINE\" but it should be right. \r\nIf the java on your phone resets itself and breaks you will see nothing for an extended period of time.\r\nIf the pin process goes badly and it knows it you will get \"STAMP ERROR.\"\r\n\r\nYou may still have to wait a bit for the timeline pin to show on your timeline even after a successful send. The official pebble documentation on a timeline pin showing up is: \"it could take up to 15 minutes, but it is usually much faster than that.\""}, {"version": "1.4", "published_date": "2015-06-02T16:20:02.725Z", "release_notes": "added stamPete font with permission from Joe Bob Graphics. www.joebob.nl\r\n\r\nStamp will now cycle between the two fonts! Maybe more are to come..."}, {"version": "1.3", "published_date": "2015-06-02T04:37:39.090Z", "release_notes": "Rearranged UI again with a more readable rubber stamp looking font. As a side effect of changing the way the stamp time is calculated it gets a cool delay that looks like someone is stamping it after the rest of the UI updates. Nice.\r\n\r\nUsing Dirty Ego font by Misprinted Type\r\nhttp://www.fontspace.com/misprinted-type/dirty-ego"}, {"version": "1.2", "published_date": "2015-06-01T19:38:44.617Z", "release_notes": "Added a stamp looking font for Stamped time and text. Got rid of star notification. \"STAMPED to Timeline\" now appears to confirm that the pin was saved (happens before the time updates for me...).\r\nAccompanying pictures and screenshots to be updated tonight."}, {"version": "1.1", "published_date": "2015-06-01T04:51:55.860Z", "release_notes": "Changed battery icon  to be red and less filled to indicate LOW battery."}, {"version": "1.0", "published_date": "2015-06-01T03:41:46.979Z", "release_notes": "Officially labeled release. See 0.5 for details on what is actually in this thing."}, {"version": "0.5", "published_date": "2015-06-01T03:37:39.094Z", "release_notes": "Will not work with this file due to needing to publish to get the UUID...\r\nInitial Release:\r\n\r\nSave a time stamp nearly instantly by entering the app. Notification icon returned from .js once pin is requested.\r\nApp contains fully functional watchface with a BIG font to show the time the app was entered and the current time. Bluetooth icon and short, long, short vibration if bluetooth is disconnected. Battery icon if Battery is 20% or below.\r\n\r\nCurrent background color is GColorChromeYellow because I like orange.\r\n\r\nFree font for time is VCR_OSD_MONO.\r\nText uses system fonts.\r\nCurrently only in English. If someone has a better international way to designate which time is which I might change this in the future.\r\n\r\nIf anybody reads release notes I do respond to email and suggestions.\r\nMake it a great day!"}], "companions": {"ios": null, "android": null}, "compatibility": {"ios": {"supported": true, "min_js_version": -1}, "android": {"supported": true}, "aplite": {"supported": true, "firmware": {"major": 2}}, "basalt": {"supported": true, "firmware": {"major": 3}}, "chalk": {"supported": false, "firmware": {"major": 3}}, "diorite": {"supported": true, "firmware": {"major": 3}}, "emery": {"supported": true, "firmware": {"major": 3}}}, "created_at": "2015-06-01T03:05:36.999Z", "description": "Save a Timestamp of the current time to the timeline just by entering the app! Set a button shortcut for one button logging. Use the microphone to label your Timestamp! (option to turn OFF)\r\n\r\n\"STAMPED TO TIMELINE\" will show up after the timeline pin request is sent (it might take a bit). It may take a few seconds to 15 min for the pin to actually show on the timeline, but you do not need to remain in the app.\r\n\r\nYou can stay in the app for the Timestamp list and a fully functional watchface with a bluetooth disconnect warning (short long short vibration and icon) and low battery warning (icon @ 20% or below). In a BIG monospaced font you will see the current time above the Timestamp (rubber stamp font, get it?).\r\n\r\nThe minutes since you stamped will show at the top.\r\n\r\nUse your pebble for other tasks, go to the past timeline or the list in the app to see your Timestamp. \r\n\r\nWhy would you use this?\r\n\r\nKeep track of fuzzy timing: At bedtime you tell your child you will stay 5 more minutes. You look at your watch. Several minutes later you look at your watch but can't remember what time it was the first time.\r\n\r\nLeave a breadcrumb trail of time.  Like when you take your ibuprofen, track potty training... The last 50 Timestamps are saved in a list. Use the options to manage your list.\r\n\r\nCreate your own use case with this simple tool at your finger tips (literally)!\r\n\r\nNote: Past Timeline remembers 24-48 hours. App remembers last 50 timestamps.\r\n\r\nFont\r\nDirty Ego-MisprintedType\r\nstamPete-http://www.joebob.nl\r\nVCR OSD Mono-Riciery Leal\r\n\r\nGive it a heart of you like it!", "developer_id": "54e40265862a80802600003c", "header_images": [{"orig": "https://assets.getpebble.com/api/file/UnskeuWBTTW0UWzULM4Y/convert?cache=true&fit=crop", "720x320": "https://assets.getpebble.com/api/file/UnskeuWBTTW0UWzULM4Y/convert?cache=true&fit=crop&w=720&h=320"}, {"orig": "https://assets.getpebble.com/api/file/Kyf715g2Q0uhtB0Z0ipR/convert?cache=true&fit=crop", "720x320": "https://assets.getpebble.com/api/file/Kyf715g2Q0uhtB0Z0ipR/convert?cache=true&fit=crop&w=720&h=320"}], "hearts": 41, "icon_image": {"28x28": "https://assets.getpebble.com/api/file/ljAqwcjzTwWnJfIu5x3k/convert?cache=true&fit=crop&w=28&h=28", "48x48": "https://assets.getpebble.com/api/file/ljAqwcjzTwWnJfIu5x3k/convert?cache=true&fit=crop&w=48&h=48"}, "id": "556bcc004809024e87000083", "latest_release": {"id": "56b4e8b0d49be5c931000019", "js_md5": "7c77de6b02128ac52bdbe2f338291278", "js_version": -1, "pbw_file": "https://www.filepicker.io/api/file/7sDKgnvTEWeHoyVsilUD", "published_date": "2016-02-05T18:24:05.678Z", "release_notes": "Reduced size of messages between watch and phone which is now allowing the Timestamp to the Timeline to work on the original Pebble! ", "version": "3.2"}, "links": {"add": "https://dev-portal.getpebble.com/api/applications/556bcc004809024e87000083/add", "remove": "https://dev-portal.getpebble.com/api/applications/556bcc004809024e87000083/remove", "add_heart": "https://dev-portal.getpebble.com/api/applications/556bcc004809024e87000083/add_heart", "remove_heart": "https://dev-portal.getpebble.com/api/applications/556bcc004809024e87000083/remove_heart", "add_flag": "https://dev-portal.getpebble.com/api/applications/556bcc004809024e87000083/flags/add", "remove_flag": "https://dev-portal.getpebble.com/api/applications/556bcc004809024e87000083/flags/remove", "share": "https://apps.getpebble.com/applications/556bcc004809024e87000083"}, "list_image": {"80x80": "https://assets.getpebble.com/api/file/RGUQzvdLQ3WnPqvLVa3p/convert?cache=true&fit=crop&w=80&h=80", "144x144": "https://assets.getpebble.com/api/file/RGUQzvdLQ3WnPqvLVa3p/convert?cache=true&fit=crop&w=144&h=144"}, "published_date": "2015-06-01T03:41:57.309Z", "screenshot_hardware": "basalt", "screenshot_images": [{"144x168": "https://assets.getpebble.com/api/file/PYHA6wiIQTG6XGcqRMed/convert?cache=true&fit=crop&w=144&h=168"}, {"144x168": "https://assets.getpebble.com/api/file/k3fgW0fSEmpw1HyGQzYK/convert?cache=true&fit=crop&w=144&h=168"}, {"144x168": "https://assets.getpebble.com/api/file/FtcawF7ORefiXQCKKa3p/convert?cache=true&fit=crop&w=144&h=168"}, {"144x168": "https://assets.getpebble.com/api/file/indUzDywRluXyga58764/convert?cache=true&fit=crop&w=144&h=168"}, {"144x168": "https://assets.getpebble.com/api/file/miP6yu9NTtiheX4VLier/convert?cache=true&fit=crop&w=144&h=168"}], "source": "", "title": "Timestamp", "type": "watchapp", "uuid": "ce0e040b-37a6-48ca-9ca9-099b9f14bae6", "website": ""}