{"data":[{"author":"kamotswind","capabilities":["location","configurable"],"category_id":"528d3ef2dc7b5f580700000a","category_name":"Faces","category_color":"ffffff","changelog":[{"version":"4.0","published_date":"2016-04-03T14:56:57.133Z","release_notes":"Fixed a few bugs with weather display, should now be more reliable and also display an error code when there is a problem fetching weather.\r\n\r\nWeather error codes:\r\nGPS? = Couldn't get location. You may need to turn on location services (Only \"coarse\" fix required, which may not need GPS radio)\r\n\r\nNET? = Failed to connect to the weather API, check your wifi or cellular network connection.\r\n\r\nAPI? = Error when requesting weather from the API. Please report this error to me.\r\n\r\nERR! = Unknown error. Please report this error to me. If needed I will add additional error codes once I find the problem.\r\n"},{"version":"3.9","published_date":"2016-01-31T06:43:07.562Z","release_notes":"Updated to SDK 3.8.2, looks much better on the original Pebbles. Pebble Time Round support coming soon!"},{"version":"3.8","published_date":"2015-09-08T03:38:14.243Z","release_notes":"New settings have been added to change the frequency of weather updates and to switch between Celsius or Fahrenheit temperature display. Also fixed a small bug with the weather update timing that may cause duplicate updates."},{"version":"3.7","published_date":"2015-09-03T03:53:39.850Z","release_notes":"Fixed a bug that occasionally caused the temperature display to show 200 degrees. Also made some improvements to the code for efficiency which will hopefully improve battery life."},{"version":"3.6","published_date":"2015-09-01T01:35:41.097Z","release_notes":"Improved the API responses by registering and using an API key. Processing of the return data still needs some tweaking. Also now has sun and moon icons which is intended by the OpenWeatherMap API."},{"version":"3.4","published_date":"2015-08-29T19:59:44.182Z","release_notes":"Improved the weather update timing which should reduce the chance of receiving a \"PHN?\" error. Also added a new weather age display. The time displayed is based on the API's timestamp of how old the weather information is. This is not how long since the last weather update, which is still every 20 minutes."},{"version":"3.3","published_date":"2015-08-29T16:36:10.568Z","release_notes":"This release fixes a few bugs in the weather code. On B&W Pebbles (aplite) the weather was sometimes not updating at all. This was due to a timing issue between when the request was sent from the watch and when the javascript was ready on the phone. This didn't affect color Pebbles (basalt). Even with the fix you may still encounter a \"PHN?\" error which should clear itself and display weather data within 60 seconds. There was also a problem that affected both platforms where a certain weather status wouldn't display any icon; this has also been fixed. I plan to do some additional work with the weather icons to improve the information displayed. Right now they match exactly what the API says to display, but I have noticed the API has additional information that would better be represented by a different icon."},{"version":"3.2","published_date":"2015-08-28T00:32:08.470Z","release_notes":"Changed the way that weather updates are timed and triggered. Should be more reliable."},{"version":"3.1","published_date":"2015-08-26T15:55:37.625Z","release_notes":"Increased weather update frequency to every 20 minutes."},{"version":"3.0","published_date":"2015-08-26T05:35:27.496Z","release_notes":"Added weather display capabilities (off by default). Uses current location provided by phone and queries openweathermap.org for the weather. Currently only displays temperature in Fahrenheit. Refreshes every 30 minutes. Configuration options for refresh time and temperature format coming soon!"},{"version":"2.2","published_date":"2015-08-14T01:27:06.812Z","release_notes":"Added ability to change the digital display to Zulu (UTC) time instead of local time."},{"version":"2.1","published_date":"2015-08-10T04:39:32.482Z","release_notes":"Added option to display a seconds hand (including custom color!). When enabled this may reduce battery life. Added by request for those in the medical field. Also added an icon to indicate when the watch is connected to power but not charging (usually when fully charged)."},{"version":"2.0","published_date":"2015-07-28T00:01:30.123Z","release_notes":"This version includes new capabilities to change the watchface \"color\" settings on the B&W Pebble. Also changed the way things load so when the configuration is changed the watchface will reload automatically."},{"version":"1.6","published_date":"2015-07-26T04:11:06.266Z","release_notes":"This version has a new Bluetooth status display. When the display is enabled in the configuration interface, a Bluetooth symbol will appear just below the battery status display if the phone is connected. If the phone is not connected, nothing will be displayed. Also, this version increases the thickness of the clock border on B&W Pebbles."},{"version":"1.5","published_date":"2015-07-23T21:59:21.571Z","release_notes":"Added ability to change how many hour markers are displayed."},{"version":"1.4","published_date":"2015-07-23T06:27:25.191Z","release_notes":"The configuration window will now remember your settings so each time you go to change your configuration it will display the current configuration. This will only work after you save a new configuration with this new version (sorry)."},{"version":"1.3","published_date":"2015-07-21T17:23:33.169Z","release_notes":"Fixed issue with version number not writing to persistant storage which could cause default color issues for new users (issue 1 @ github). Changed the battery low and charging indicators so they work with any color scheme and actually show up on the original B&W Pebbles. The beginnings of some new features are in this version, but not visible or working yet."},{"version":"1.2","published_date":"2015-07-17T02:16:25.816Z","release_notes":"Finally finished the color changing interface! I also added an app icon which should show up on the watch in the watchfaces menu. Also has code to convert past configuration versions so I can add more features in the future. I eventually need to figure out how to hide the color selection options and replace it with an \"invert\" toggle for anyone using the original B&W Pebble."},{"version":"1.0","published_date":"2015-07-16T00:51:32.254Z","release_notes":"Added support for the original B&W Pebbles. Increased the font size of the digital time display. Made a small tweak to the battery status display so it is more visible at 10% while still maintaining a good ratio for at-a-glance read of the capacity remaining."},{"version":"0.9","published_date":"2015-07-14T06:04:55.701Z","release_notes":"Configuration interface now works. The only option available right now is to toggle on the digital time display at the bottom (a feature request). The next release will include a color picker. You do need to leave the watchface and go back to it for the changes to take effect. A reminder to do this is on the configuration page."}],"companions":{"ios":null,"android":null},"compatibility":{"ios":{"supported":true,"min_js_version":-1},"android":{"supported":true},"aplite":{"supported":true,"firmware":{"major":2}},"basalt":{"supported":true,"firmware":{"major":3}},"chalk":{"supported":false,"firmware":{"major":3}},"diorite":{"supported":true,"firmware":{"major":3}},"emery":{"supported":true,"firmware":{"major":3}}},"created_at":"2015-07-02T00:43:03.205Z","description":"This is a simple low battery utilization watchface with fully customizable colors, battery monitoring and toggle-able Bluetooth status display among other options. Also has a toggle-able weather display.\r\n","developer_id":"55754e7a315505af78000003","header_images":"","hearts":13,"id":"55948917327b5a1a0d0000a0","latest_release":{"id":"57012f23900df42a0400003e","js_md5":"a6e79e0a2ba5e88ff4cc7e6034d9f87d","js_version":-1,"pbw_file":"https://www.filepicker.io/api/file/bVehhZJxQCaU1gnqiq7V","published_date":"2016-04-03T14:56:57.133Z","release_notes":"Fixed a few bugs with weather display, should now be more reliable and also display an error code when there is a problem fetching weather.\r\n\r\nWeather error codes:\r\nGPS? = Couldn't get location. You may need to turn on location services (Only \"coarse\" fix required, which may not need GPS radio)\r\n\r\nNET? = Failed to connect to the weather API, check your wifi or cellular network connection.\r\n\r\nAPI? = Error when requesting weather from the API. Please report this error to me.\r\n\r\nERR! = Unknown error. Please report this error to me. If needed I will add additional error codes once I find the problem.\r\n","version":"4.0"},"links":{"add":"https://dev-portal.getpebble.com/api/applications/55948917327b5a1a0d0000a0/add","remove":"https://dev-portal.getpebble.com/api/applications/55948917327b5a1a0d0000a0/remove","add_heart":"https://dev-portal.getpebble.com/api/applications/55948917327b5a1a0d0000a0/add_heart","remove_heart":"https://dev-portal.getpebble.com/api/applications/55948917327b5a1a0d0000a0/remove_heart","add_flag":"https://dev-portal.getpebble.com/api/applications/55948917327b5a1a0d0000a0/flags/add","remove_flag":"https://dev-portal.getpebble.com/api/applications/55948917327b5a1a0d0000a0/flags/remove","share":"https://apps.getpebble.com/applications/55948917327b5a1a0d0000a0"},"list_image":{"80x80":"https://assets.getpebble.com/api/file/DfE2oEnIRvK9kBB4k8CF/convert?cache=true&fit=crop&w=80&h=80","144x144":"https://assets.getpebble.com/api/file/DfE2oEnIRvK9kBB4k8CF/convert?cache=true&fit=crop&w=144&h=144"},"published_date":"2016-03-30T08:51:36.943Z","screenshot_hardware":"basalt","screenshot_images":[{"144x168":"https://assets.getpebble.com/api/file/DfE2oEnIRvK9kBB4k8CF/convert?cache=true&fit=crop&w=144&h=168"},{"144x168":"https://assets.getpebble.com/api/file/rDLRTuNQR7wN5jSpLQQS/convert?cache=true&fit=crop&w=144&h=168"},{"144x168":"https://assets.getpebble.com/api/file/sKu4uloLTueLq8EXlTbh/convert?cache=true&fit=crop&w=144&h=168"},{"144x168":"https://assets.getpebble.com/api/file/mglZAVoVQFa5gTFJ273r/convert?cache=true&fit=crop&w=144&h=168"},{"144x168":"https://assets.getpebble.com/api/file/Y6TeP3KISr2Wl3WwanBf/convert?cache=true&fit=crop&w=144&h=168"}],"source":"http://github.com/theforest/Kamots-Time","title":"Kamots Time","type":"watchface","uuid":"6930038e-f881-44c5-8822-9e32066049df","website":""}],"limit":20,"offset":0,"links":{"nextPage":null}}