{"author": "David Watson", "capabilities": ["health", "location", "configurable"], "category_id": "528d3ef2dc7b5f580700000a", "category_name": "Faces", "category_color": "ffffff", "changelog": [{"version": "2.4", "published_date": "2016-12-02T18:29:52.640Z", "release_notes": "So after some fustration on for everyone, I stopped using the pebble's app_timer function and wrote my own.  This prevents me from sleeping as deeply, but performs reliably which is more important.  The options to disable these functions now also work and I changed the idle timeout to 45 minutes"}, {"version": "2.3", "published_date": "2016-11-30T15:05:42.875Z", "release_notes": "For whatever reason the 30 minute idle timer is not working correctly when the update first installs on your watch. The variable is defined correctly, it simply isn't running correctly. I changes the way I am defining the variable in this version slightly hoping it would fix the issue"}, {"version": "2.2", "published_date": "2016-11-28T21:05:10.226Z", "release_notes": "More changes =good:) Sleep has been improved to display 8888 as the time when sleeping to be clearer that the display is intentionally not updating. Sleep is also now interrupt based so it takes less battery to check and sleeps deeper. Also added an option to disable sleep. Replaced the confusing manual sleep with IDLE, which is very similar to sleep except that it detects lack of movement for 30 minutes and goes to idle. Shake your wrist to wake up your watch or use the options in the pebble app to disable. This release is also the first release compatible with the Time2, although honestly the text looks crappy due to SDK limitations. I am in the process of changing certain text elements to scaleable vector graphics, which should save space on both platforms."}, {"version": "2.1", "published_date": "2016-12-01T22:00:36.139Z", "release_notes": "Got rid of a 1K block of floating point code and fixed the average display when the user has less than a week of data in pebble health"}, {"version": "2.0", "published_date": "2016-10-07T21:05:21.211Z", "release_notes": "Big changes for v2.0 and see the new website https://sites.google.com/site/pebblelcars/ for full details.  I got the BadKey bug squished, fixed a small memory leak, you can now change the text color, you have a step goal, there is a neat animation when you achieve the step goal, the watchface sleeps with you now, there is a manual sleep option.  I believe you will have to save your settings once to reinitalize the settings for v2.  Enjoy"}, {"version": "1.9", "published_date": "2016-09-23T21:27:34.914Z", "release_notes": "Changed the health meter to simultaneously display your progress to your instantaneous average steps in green and to your average daily steps in blue.  Also added an option to replace the weather with a custom message entered in the settings menu."}, {"version": "1.8", "published_date": "2016-09-16T20:39:58.952Z", "release_notes": "I don't know what happened in 1.7, pebble crashed when I published the app and for some reason that blanked several text fields on the watchface.  This is identical to 1.7 except the text description is 1 character longer."}, {"version": "1.7", "published_date": "2016-09-16T20:32:03.332Z", "release_notes": "Added an option to display a text version of the weather (the very last config item) as well as moved the enterprise slightly so it no longer touches the LCARS interface"}, {"version": "1.6", "published_date": "2016-09-16T20:28:27.986Z", "release_notes": "Bug fix to the weekday name being too wide in some circumstances.  I also neglected to mention the health meter changes colors based on the goal.  It will fill up with green if you select your current average, ie you are trodding about town.  It will be blue when the daily average is the goal, the sky is the limit.  I should also mention that the goal is defined by the average for this day of the week (ie all Wednesdays) , the pebble health app appears to use a slightly different average.  Just FYI"}, {"version": "1.5", "published_date": "2016-09-13T21:37:19.398Z", "release_notes": "Added the name of the day of the week at the upper left (default on and setting to turn off), and various formats of the week of the year near the top left (default hidden with 3 formatting options to turn on).  I am also trying to work out some other code, but didn't want to keep you waiting too long"}, {"version": "1.4", "published_date": "2016-09-05T20:47:05.129Z", "release_notes": "Added user options for hiding the battery percentage, option for displaying the stardate in UK format, and fixed a few garbage collector type issues.  I also moved the health meter text within the progress bar and added an option for the progress goal to be either the average steps for today as of this minute, or the average steps for the entire day.  If you select the former, remember a prolonged rest could make your progress bar go backwards"}, {"version": "1.3", "published_date": "2016-09-01T14:33:43.804Z", "release_notes": "Enjoy the flexibility to choose one of three weather providers"}, {"version": "1.1", "published_date": "2016-08-26T22:14:11.017Z", "release_notes": "Welcome to weather on your LCARS Interface.  The app now uses pebble-events and there is also a settings page, which caused a major rewrite, so get yourself OpenWeatherMap so get yourself an API key and enjoy.  More is on the development list so stay tuned for more updates"}, {"version": "0.12", "published_date": "2016-08-18T20:05:22.449Z", "release_notes": "It doesn't look very different, but under the hood there are a lot of changes.  The entire LCARS interface is now interactively drawn rather than a simple bitmap (which makes the app smaller and will enable me to change the color scheme at the users wish in a future settings page), the bluetooth icon is now drawn instead of a bitmap, the Bluetooth icon turns red when disconnected, I fixed the health meter progress bar to proper progress towards the full daily average, and I temporarily filled in the daily average steps near where the weather is going to be displayed.  I went to the Star Trek Experience at the Intrepid Sea, Air & Space Museum in New York to do some research as well.  Based on that I have fine turned the curvature of the LCARS elbows and the relative size of the buttons and bars, though I did take some small liberties near the edges for style.  The colors used are also based on the LCARS panels on the bridge scene at the museum and matching visually to my pebble time the resulting color.  I haven't got any emails yet and please consider providing input though I do see a few favs...thanks for that.  The actual enterprise is still a bitmap because I can't get pdc vector conversions to display on the pebble."}, {"version": "0.11", "published_date": "2016-08-12T20:00:04.246Z", "release_notes": "This is alpha V0.11 Release and fixes a bug where the health could exceed 100%. I have not put in the weather functionality, a settings page, or tewaked the font layout for the small text. I am working on it and I would greatly appreciate your feedback"}, {"version": "0.1", "published_date": "2016-08-12T17:49:17.170Z", "release_notes": "I am still getting the hang of snprintf so this fixes the display of the number of steps. All else still applies This is alpha V0.1 Release. I have not put in the weather functionality, a settings page, or tewaked the font layout for the small text. I am working on it and I would greatly appreciate your feedback"}], "companions": {"ios": null, "android": null}, "compatibility": {"ios": {"supported": true, "min_js_version": -1}, "android": {"supported": true}, "aplite": {"supported": false, "firmware": {"major": 3}}, "basalt": {"supported": true, "firmware": {"major": 3}}, "chalk": {"supported": false, "firmware": {"major": 3}}, "diorite": {"supported": false, "firmware": {"major": 3}}, "emery": {"supported": true, "firmware": {"major": 3}}}, "created_at": "2016-08-12T15:57:54.889Z", "description": "Everyone: Idle and Sleep are now fixed and respond to the settings\r\n\r\nThe captain has assigned the task of implementing an effective display for his wrist based ship status device, it has been many years since the academy but this lieutenant is up for the task.  The task mandates the design maximize the amount of information displayed and be very configurable, however feedback from other starfleet officers is welcome via the support email link. \r\n\r\nThe 21st century concept of monetary compensation does not apply and the code is open source\r\nhttps://github.com/ddwatson/Pebble1701LCARS .  Attribution required if using the code.\r\n\r\nBig changes again for v2.4 and please see the website https://sites.google.com/site/pebblelcars/ for a description of all the features of the watchface.\r\n\r\nSee the version information for the latest info and please remember to provide input via support", "developer_id": "564ba91d0fa9d91476000004", "header_images": "", "hearts": 61, "id": "57adf202bb85edbc76000241", "latest_release": {"id": "5841bd8fca3094659f000853", "js_md5": "4079cb5c2663d0030c8cbf717e8fd07a", "js_version": -1, "pbw_file": "https://www.filepicker.io/api/file/tmq2s034REWuicf81UoK", "published_date": "2016-12-02T18:29:52.640Z", "release_notes": "So after some fustration on for everyone, I stopped using the pebble's app_timer function and wrote my own.  This prevents me from sleeping as deeply, but performs reliably which is more important.  The options to disable these functions now also work and I changed the idle timeout to 45 minutes", "version": "2.4"}, "links": {"add": "https://dev-portal.getpebble.com/api/applications/57adf202bb85edbc76000241/add", "remove": "https://dev-portal.getpebble.com/api/applications/57adf202bb85edbc76000241/remove", "add_heart": "https://dev-portal.getpebble.com/api/applications/57adf202bb85edbc76000241/add_heart", "remove_heart": "https://dev-portal.getpebble.com/api/applications/57adf202bb85edbc76000241/remove_heart", "add_flag": "https://dev-portal.getpebble.com/api/applications/57adf202bb85edbc76000241/flags/add", "remove_flag": "https://dev-portal.getpebble.com/api/applications/57adf202bb85edbc76000241/flags/remove", "share": "https://apps.getpebble.com/applications/57adf202bb85edbc76000241"}, "list_image": {"80x80": "https://assets.getpebble.com/api/file/zUidWD1RAuB1pEvUN24Q/convert?cache=true&fit=crop&w=80&h=80", "144x144": "https://assets.getpebble.com/api/file/zUidWD1RAuB1pEvUN24Q/convert?cache=true&fit=crop&w=144&h=144"}, "published_date": "2016-08-12T17:49:28.873Z", "screenshot_hardware": "basalt", "screenshot_images": [{"144x168": "https://assets.getpebble.com/api/file/zUidWD1RAuB1pEvUN24Q/convert?cache=true&fit=crop&w=144&h=168"}, {"144x168": "https://assets.getpebble.com/api/file/Oltv4pZ0TigXFZQpQ57A/convert?cache=true&fit=crop&w=144&h=168"}, {"144x168": "https://assets.getpebble.com/api/file/plEDhRKT5ivNASxsEUI1/convert?cache=true&fit=crop&w=144&h=168"}, {"144x168": "https://assets.getpebble.com/api/file/S5lBo8arQGOwqxa55AGe/convert?cache=true&fit=crop&w=144&h=168"}], "source": "https://github.com/ddwatson/Pebble1701LCARS", "title": "NCC-1701D LCARS v1", "type": "watchface", "uuid": "da71a728-bf9d-4ecc-8d31-0d80775e65ae", "website": "https://sites.google.com/site/pebblelcars/"}