{"author": "Cody Doremus", "capabilities": ["location", "configurable"], "category_id": "528d3ef2dc7b5f580700000a", "category_name": "Faces", "category_color": "ffffff", "changelog": [{"version": "2.14", "published_date": "2016-02-09T05:44:50.880Z", "release_notes": "Added two new date settings to use month abbreviations instead of numbers. ('Fe' vs ' 2')"}, {"version": "2.13", "published_date": "2016-02-08T15:39:41.175Z", "release_notes": "Reduced size of message between phone and watch."}, {"version": "2.12", "published_date": "2015-10-27T01:21:01.347Z", "release_notes": "Added openweathermap.org api key."}, {"version": "2.11", "published_date": "2015-08-15T03:57:57.592Z", "release_notes": "Fixed code that was not working with 2.3 release and causing the watchface to freeze when settings or colors updated. Hopefully fixed bug with weather icons sometimes going blank."}, {"version": "2.10", "published_date": "2015-08-08T05:24:00.130Z", "release_notes": "Changed update method for settings and color changes based on day/night. Should stop the freezing that started happening with the pebble 2.3 update."}, {"version": "2.9", "published_date": "2015-08-08T12:56:48.404Z", "release_notes": "Changed key for temperature communication. This should fix the temperature getting overridden to 0. Still looking for a bug that seems to only happen on a fresh load. "}, {"version": "2.8", "published_date": "2015-06-23T05:38:01.175Z", "release_notes": "Bug fixes: Through working on an upcoming app I found I was not handling images correctly. Now I am properly checking to make sure I don't create the same image more than once and I only delete images that exist. Hopefully this fixes the behavior that sometimes instead of honoring a button press it stays on the watch and the temperature goes to 0. I will continue to investigate if I manage to get that behavior again."}, {"version": "2.7", "published_date": "2015-06-22T16:38:30.747Z", "release_notes": "Centered date information. I think it looks a little better. "}, {"version": "2.6", "published_date": "2015-06-21T11:53:36.628Z", "release_notes": "User request: added a setting to switch to Day-Month order on the date.\r\n\r\nMenu icons and names are being adjusted so that my watchfaces are more easily identifiable. The shrunk screenshot is not super helpful if you are switching between the full to get more information and lite versions to save battery. The menu icon will now have the initials of the Precisioneer type (PC for Precisioneer Color)."}, {"version": "2.5", "published_date": "2015-06-13T12:47:51.058Z", "release_notes": "Maintenance release. Just changed the defaults on first load to be the same settings that I use (except for my weather underground api key). Hopefully makes the first load look better. I am sure the first thing someone does is get in and change the settings how they want."}, {"version": "2.4", "published_date": "2015-06-07T14:52:29.105Z", "release_notes": "Spelling is hard..."}, {"version": "2.3", "published_date": "2015-06-06T13:40:58.605Z", "release_notes": "Final Final tweaks unless I think of a new idea or somebody else gives me a good suggestion or bugs.\r\n\r\nChanged openweathermap request to high low temperature instead of day/night avg temp.\r\nChanged the day/night icon to red up arrow/down blue arrow.\r\nUpdated menu icon with new layout, thought it is so small maybe that does not matter."}, {"version": "2.2", "published_date": "2015-06-06T06:17:30.545Z", "release_notes": "Added a battery charging icon. Currently not planning any more updates unless people give me good suggestions, I find a bug, or I feel inspired."}, {"version": "2.1", "published_date": "2015-06-05T20:02:13.624Z", "release_notes": "Oops.. put the initialization for the red battery icon (20% or less) in the wrong place. Fixed now."}, {"version": "2.0", "published_date": "2015-06-05T17:14:23.763Z", "release_notes": "Major Update! Now you can get a free API key for weather underground and vastly improve the quality of your weather reporting!\r\nTo get your key go to: \r\n\r\nhttp://www.wunderground.com/weather/api/d/login.html\r\n\r\nMore instructions are in the description of the settings page. You will see new icons when you use this free setting!\r\nIf you do not have a key you will still get openweathermap.org weather.\r\n\r\nMajorly improved loading efficiency and memory usage by only loading images when they are needed.\r\nImproved the reliability of getting weather. The biggest failure was the phone not responding with a location, so now it will keep asking until it gets a response!\r\nFixed a potential bug where you would get Celsius temperature even if you selected Fahrenheit."}, {"version": "1.4", "published_date": "2015-06-04T02:24:31.109Z", "release_notes": "Major overhaul of the calls to internet weather. Now it will not attempt an update if it did so in the last 17 minutes. It will attempt to update when the watchface is loaded and every 20 minutes (at 7, 27, and 47 minutes past the hour). This fixes a bug where weather was called multiple times in a row due to timing issues and should make the weather more reliable. This falls more in line with actually using the timeline so the weather does not attemp to update every time you go back to the watch. Limiting the possible calls during the day also opens up the possibility for calling a more reliable weather provider... Stay tuned for an update.\r\n\r\nAdded Yellow battery icon @ 40% State of Charge and Red battery icon @ 20% SOC."}, {"version": "1.3", "published_date": "2015-05-27T03:32:43.502Z", "release_notes": "Changed the name from the [apparently] trademark infringing \"Pebleneer\" to [hopefully] not law breaking \"Precisioneer.\""}, {"version": "1.2", "published_date": "2015-05-19T04:09:32.484Z", "release_notes": "Shrunk icon to show whole watchface instead of just the corner of the watchface. Text is a little sketchy, but hopefully it gets the point across."}, {"version": "1.1", "published_date": "2015-05-08T05:50:45.417Z", "release_notes": "Changed border around night temp icon to black so it matches the rest of the icons.\r\nCleaned up unnecessary code for saving weather info through a settings change.\r\nAdded a screenshot for the image in pebble app."}, {"version": "1.0", "published_date": "2015-05-07T07:15:35.832Z", "release_notes": "First Color version! Use \"Pebbleneer\" for BW, images and settings are optimized.\r\nOptimized images for color version with outlines and transparent backgrounds to make them show up nicely [hopefully] no matter what colors you choose. You can pick different colors for day and night. Use the full 64 color pallet to make this watch work for you!\r\n\r\nImprovements over Pebbleneer 1.2 - persistent weather - no more blank screens after the initial load! I originally thought you would come back hours later and the weather would be inaccurate, but I found it is common to go back and forth and sometimes the communication does not straiten out with the phone until the 30 minute update, so now it will load last known good value.\r\nReduced redundant images, looking to add more detailed weather images in the future.\r\nFixed a bug where temperature would revert to C if the weather refreshed from a settings change.\r\n\r\nSo far I have not noticed crashes on the first load. These were happening with regular BW pebble I think because settings web page and weather webpage were being pinged at the same time and the java script could not handle it. Hopefully 3.0 fixed this, otherwise go to a different screen and come back and it should not crash again."}], "companions": {"ios": null, "android": null}, "compatibility": {"ios": {"supported": true, "min_js_version": -1}, "android": {"supported": true}, "aplite": {"supported": false, "firmware": {"major": 3}}, "basalt": {"supported": true, "firmware": {"major": 3}}, "chalk": {"supported": false, "firmware": {"major": 3}}, "diorite": {"supported": false, "firmware": {"major": 3}}, "emery": {"supported": true, "firmware": {"major": 3}}}, "created_at": "2015-05-07T07:00:50.952Z", "description": "Data for those who need to know precisely how you want it. Now in COLOR! Configurable, because everyone is a little different and sometimes picky (see Engineer).\r\nUse Pricisioneer for black/white watches.\r\n\r\nGet a free api key to get UndergroundWeather! Instructions on settings page.\r\nOtherwise use openweathermap.org\r\n\r\nSettings must have an internet connection. Serial number is on the back of your watch. Thanks to Matt https://setpebble.com/ \r\n\r\nBackground & Text Colors different for day & Night! Choose from 64 options each!\r\n\r\nSeconds-because you like to be precise (or save battery by turning off)\r\n\r\nNo leading 0s for date and hours-because they are annoying. Pick Month-Day or Day-Month order.\r\n\r\nNumerical Battery level-rounded to the nearest 10 with icons for high, medium, low, and charging.\r\n\r\nBluetooth status with custom short long short vibration for when it goes ??-So you realize you left your phone in the car or on your wireless charger\r\n\r\nChoose Forecast on Left (or right) so you can plan what to wear. Current icon and temp in the center so you know what the outside is doing when you are far away from windows (UndergroundWeather \"Feels like temperature\").  Updated every 20 min. Temperature C or F (setting)\r\n\r\nCurrent City-So you know where your phone thinks it is\r\n\r\nExtra time data-A/P, year, or none\r\n\r\nCustomizable Day Abbreviation-English days not preferred? Need both letters to be capitalized?\r\n\r\nMonospaced Font - so all the text is in a predictable place. Free font is VCR_OSD_MONO by Riciery Leal\r\n\r\nGive it a heart of you like it!", "developer_id": "54e40265862a80802600003c", "header_images": "", "hearts": 38, "id": "554b0da2578fc67523000004", "latest_release": {"id": "56b97cc732a67a42ad00004b", "js_md5": "eef7d1025f68e3cb6631e6689d2df25a", "js_version": -1, "pbw_file": "https://www.filepicker.io/api/file/XPRpSDduQGaEjW85NfGY", "published_date": "2016-02-09T05:44:50.880Z", "release_notes": "Added two new date settings to use month abbreviations instead of numbers. ('Fe' vs ' 2')", "version": "2.14"}, "links": {"add": "https://dev-portal.getpebble.com/api/applications/554b0da2578fc67523000004/add", "remove": "https://dev-portal.getpebble.com/api/applications/554b0da2578fc67523000004/remove", "add_heart": "https://dev-portal.getpebble.com/api/applications/554b0da2578fc67523000004/add_heart", "remove_heart": "https://dev-portal.getpebble.com/api/applications/554b0da2578fc67523000004/remove_heart", "add_flag": "https://dev-portal.getpebble.com/api/applications/554b0da2578fc67523000004/flags/add", "remove_flag": "https://dev-portal.getpebble.com/api/applications/554b0da2578fc67523000004/flags/remove", "share": "https://apps.getpebble.com/applications/554b0da2578fc67523000004"}, "list_image": {"80x80": "https://assets.getpebble.com/api/file/xtmbKCEQDu1nJxCAOqmh/convert?cache=true&fit=crop&w=80&h=80", "144x144": "https://assets.getpebble.com/api/file/xtmbKCEQDu1nJxCAOqmh/convert?cache=true&fit=crop&w=144&h=144"}, "published_date": "2015-08-08T16:04:45.405Z", "screenshot_hardware": "basalt", "screenshot_images": [{"144x168": "https://assets.getpebble.com/api/file/xtmbKCEQDu1nJxCAOqmh/convert?cache=true&fit=crop&w=144&h=168"}, {"144x168": "https://assets.getpebble.com/api/file/zvdOuzTweQEaxbcXbXlA/convert?cache=true&fit=crop&w=144&h=168"}, {"144x168": "https://assets.getpebble.com/api/file/kIMyTEaLTNGKXp9UeRmr/convert?cache=true&fit=crop&w=144&h=168"}, {"144x168": "https://assets.getpebble.com/api/file/HkksyA9VRqOjanXz1rhY/convert?cache=true&fit=crop&w=144&h=168"}, {"144x168": "https://assets.getpebble.com/api/file/lrIeoyxT5q2dKkkTLX0m/convert?cache=true&fit=crop&w=144&h=168"}], "source": "", "title": "Precisioneer Color", "type": "watchface", "uuid": "47cf7dc3-6f91-45ab-9980-975a58be7aa2", "website": ""}